Imputasi adalah mengganti nilai/data yang hilang (missing value; NaN; blank) dengan nilai pengganti.

Teknik imputasi berdasarkan tipe data, terdiri dari:
1. Tipe data Variabel Numerik, dengan cara:
    - imputasi mean/median.
    - imputasi nilai suka-suka (arbitrary).
    - Imputasi nilai/data ujung (end of tail).
    
2. Tipe data Variabel Kategorikal, dengan cara : 
    - Imputasi Kategori yang sering muncul.
    - Tambah kategori yang hilang.

## Data Numerik

#### Mean

In [1]:
import pandas as pd
import numpy as np

kolom = {'col1':[2,9,19],
         'col2':[5,np.nan,17],
         'col3':[3,9,np.nan],
         'col4':[4,9,1],
         'col5':[np.nan,7,np.nan]}

data = pd.DataFrame(kolom)

In [2]:
data

   col1  col2  col3  col4  col5
0     2   5.0   3.0     4   NaN
1     9   NaN   9.0     9   7.0
2    19  17.0   NaN     1   NaN

In [3]:
data.fillna(data.mean())

   col1  col2  col3  col4  col5
0     2   5.0   3.0     4   7.0
1     9  11.0   9.0     9   7.0
2    19  17.0   6.0     1   7.0

#### Arbitrary (Nilai suka-suka)

In [5]:
import pandas as pd
import numpy as np

umur = {'umur':[29,43,np.nan,25,34,np.nan,50]}

data = pd.DataFrame(umur)
data

   umur
0  29.0
1  43.0
2   NaN
3  25.0
4  34.0
5   NaN
6  50.0

In [6]:
data.fillna(99)

   umur
0  29.0
1  43.0
2  99.0
3  25.0
4  34.0
5  99.0
6  50.0

#### End of Tail

In [7]:
import pandas as pd
import numpy as np

umur = {'umur':[29,43,np.nan,25,34,np.nan,50]}

data = pd.DataFrame(umur)
data

   umur
0  29.0
1  43.0
2   NaN
3  25.0
4  34.0
5   NaN
6  50.0

In [10]:
pip install feature-engine

Collecting feature-engineNote: you may need to restart the kernel to use updated packages.
  Downloading feature_engine-1.2.0-py2.py3-none-any.whl (205 kB)
Collecting statsmodels>=0.11.1
  Downloading statsmodels-0.13.2-cp39-cp39-win_amd64.whl (9.1 MB)
Requirement already satisfied: numpy>=1.18.2 in c:\users\ribka\appdata\local\programs\python\python39\lib\site-packages (from feature-engine) (1.22.2)
Requirement already satisfied: scikit-learn>=0.22.2 in c:\users\ribka\appdata\local\programs\python\python39\lib\site-packages (from feature-engine) (1.0.2)

WARNING: You are using pip version 21.1.3; however, version 22.0.4 is available.
You should consider upgrading via the 'c:\users\ribka\appdata\local\programs\python\python39\python.exe -m pip install --upgrade pip' command.

Requirement already satisfied: scipy>=1.4.1 in c:\users\ribka\appdata\local\programs\python\python39\lib\site-packages (from feature-engine) (1.8.0)
Requirement already satisfied: pandas>=1.0.3 in c:\users\ribka\appdata\local\programs\python\python39\lib\site-packages (from feature-engine) (1.4.1)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\ribka\appdata\local\programs\python\python39\lib\site-packages (from pandas>=1.0.3->feature-engine) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\ribka\appdata\local\programs\python\python39\lib\site-packages (from pandas>=1.0.3->feature-engine) (2021.3)
Requirement already satisfied: six>=1.5 in c:\users\ribka\appdata\local\programs\python\python39\lib\site-packages (from python-dateutil>=2.8.1->pandas>=1.0.3->feature-engine) (1.16.0)
Requirement already satisfied: threadpoolctl>=2.0.0 in c:\users\ribka\appdata\local\programs\python\python39\lib\site-packages (from scikit-learn>=0.22.2->feature-engine) (3.1.0)
Requirement already satisfied: joblib>=0.11 in c:\users\ribka\appdata\local\programs\python\python39\lib\site-packages (from scikit-learn>=0.22.2->feature-engine) (1.1.0)
Collecting patsy>=0.5.2
  Downloading patsy-0.5.2-py2.py3-none-any.whl (233 kB)
Requirement already satisfied: packaging>=21.3 in c:\users\ribka\appdata\local\programs\python\python39\lib\site-packages (from statsmodels>=0.11.1->feature-engine) (21.3)
Requirement already satisfied: pyparsing!=3.0.5,>=2.0.2 in c:\users\ribka\appdata\local\programs\python\python39\lib\site-packages (from packaging>=21.3->statsmodels>=0.11.1->feature-engine) (3.0.7)
Installing collected packages: patsy, statsmodels, feature-engine
Successfully installed feature-engine-1.2.0 patsy-0.5.2 statsmodels-0.13.2

In [13]:
#import EndTailImputer
from feature_engine.imputation import EndTailImputer

#buat Imputer
imputer = EndTailImputer(imputation_method='gaussian',tail='right')

#fit-kan imputer ke set
imputer.fit(data)

#ubah data
test_data = imputer.transform(data)

#yuk tampilkan data
test_data

        umur
0  29.000000
1  43.000000
2  66.896905
3  25.000000
4  34.000000
5  66.896905
6  50.000000

## Bagaimana dengan data kategorikal?
Kita akan menggunakan imputasi modus

In [16]:
import pandas as pd
import numpy as np
from sklearn.impute import SimpleImputer

mobil = {'merk':['Ford','Ford','Toyota','Honda',np.nan,'Toyota','Honda','Toyota',np.nan,np.nan]}

data = pd.DataFrame(mobil)

In [17]:
data

     merk
0    Ford
1    Ford
2  Toyota
3   Honda
4     NaN
5  Toyota
6   Honda
7  Toyota
8     NaN
9     NaN

In [18]:
imputasi = SimpleImputer(strategy='most_frequent')

In [19]:
imputasi.fit_transform(data)

array([['Ford'],
       ['Ford'],
       ['Toyota'],
       ['Honda'],
       ['Toyota'],
       ['Toyota'],
       ['Honda'],
       ['Toyota'],
       ['Toyota'],
       ['Toyota']], dtype=object)

### Bagaimana kalau kita butuh untuk mengatasi missing value untuk kategorikal dan numerikal secara bersamaan?

Kita bisa gunakan random sample

In [22]:
#import dulu si RandomSample
from feature_engine.imputation import RandomSampleImputer

# silahkan buat data yang ada missing valuenya
data = {'Jenis Kelamin':['Laki-laki','Perempuan','Laki-laki','Laki-laki',np.nan,'Laki-laki','Perempuan',np.nan,'Perempuan','Laki-laki'],
       'Umur':[30,np.nan,24,21,34,np.nan,23,43,np.nan,19]}

df = pd.DataFrame(data)

In [23]:
df

  Jenis Kelamin  Umur
0     Laki-laki  30.0
1     Perempuan   NaN
2     Laki-laki  24.0
3     Laki-laki  21.0
4           NaN  34.0
5     Laki-laki   NaN
6     Perempuan  23.0
7           NaN  43.0
8     Perempuan   NaN
9     Laki-laki  19.0

In [24]:
#buat dulu imputer
imputasi = RandomSampleImputer(random_state=29)

#fitkan
imputasi.fit(df)

#ubah data
testing_df=imputasi.transform(df)

In [25]:
testing_df

  Jenis Kelamin  Umur
0     Laki-laki  30.0
1     Perempuan  43.0
2     Laki-laki  24.0
3     Laki-laki  21.0
4     Perempuan  34.0
5     Laki-laki  34.0
6     Perempuan  23.0
7     Laki-laki  43.0
8     Perempuan  23.0
9     Laki-laki  19.0